Repository: PythonFreeCourse/LMS
Catalog: lms/lmsweb/translations/*/LC_MESSAGES/messages.po
Languages: he

source: Fatal error
he: כישלון חמור

source: Your solution for the %(subject)s exercise has been checked.
he: הפתרון שלך לתרגיל %(subject)s נבדק.

source: The automatic checker gave you %(errors_num)d for your %(name)s solution.
he: הבודק האוטומטי נתן %(errors_num)d הערות על תרגילך %(name)s.

source: The automatic checker couldn't run your code.
he: הבודק האוטומטי לא הצליח להריץ את הקוד שלך.

source: The automatic checker failed in %(number)d examples in your "%(subject)s" solution.
he: הבודק האוטומטי נכשל ב־ %(number)d דוגמאות בתרגיל "%(subject)s".

source: Can not register now
he: לא ניתן להירשם כעת

source: Registration successfully
he: ההרשמה בוצעה בהצלחה

source: The confirmation link is expired, new link has been sent to your email
he: קישור האימות פג תוקף, קישור חדש נשלח אל תיבת המייל שלך

source: Your user has been successfully confirmed, you can now login
he: המשתמש שלך אומת בהצלחה, כעת אתה יכול להתחבר למערכת

source: Your password has successfully changed
he: הסיסמה שלך שונתה בהצלחה

source: Password reset link has successfully sent
he: קישור לאיפוס הסיסמה נשלח בהצלחה

source: Reset password link is expired
he: הקישור לאיפוס הסיסמה פג תוקף

source: The passwords are not identical
he: הסיסמאות שהוזנו אינן זהות

source: Invalid old password has been inserted too many times
he: הזנת סיסמה שגויה מספר רב מדי של פעמים

source: Invalid current password
he: הסיסמה הנוכחית שהוזנה שגויה

source: Invalid email
he: כתובת הדואר האלקטרוני שהוזנה אינה תקינה

source: The username is already in use
he: שם המשתמש הזה כבר נמצא בשימוש

source: The email is already in use
he: כתובת הדואר האלקטרוני הזו כבר נמצאת בשימוש

source: %(solver)s has replied for your "%(subject)s" check.
he: %(solver)s הגיב לך על בדיקת תרגיל "%(subject)s".

source: %(checker)s replied for "%(subject)s".
he: %(checker)s הגיב לך על תרגיל "%(subject)s".

source: Your solution for the "%(subject)s" exercise has been checked.
he: הפתרון שלך לתרגיל "%(subject)s" נבדק.

source: User not found
he: לא מצאנו את המשתמש

source: User is not valid
he: לא זיהינו את המשתמש

source: Invalid username or password
he: שם המשתמש או הסיסמה שהוזנו לא תקינים

source: You have to confirm your registration with the link sent to your email
he: עליך לאשר את מייל האימות

source: You are already registered to %(course_name)s course.
he: אתה כבר רשום לקורס %(course_name)s.

source: Profile picture of the Python Course
he: תמונת הפרופיל של קורס פייתון

source: Your account has been suspended by the manager.
he: המשתמש שלך הושעה על ידי מנהל המערכת.

source: For more details please contact the management team.
he: לפרטים נוספים אנא פנה אל צוות הניהול.

source: Exercise submission system for the Python Course
he: מערכת הגשת תרגילים לקורס פייתון

source: Change Password
he: שנה סיסמה

source: Insert current password and new password for changing it:
he: הזינו סיסמה ישנה וסיסמה חדשה לצורך שינוי הסיסמה:

source: Current password
he: סיסמה נוכחית

source: Password
he: סיסמה

source: Password Confirmation
he: אימות סיסמה

source: Exercises
he: תרגילים

source: Comments for the solution
he: הערות על התרגיל

source: Send
he: שלח

source: View
he: הצצה

source: Check
he: לבדיקה

source: All Exercises
he: לכל התרגילים

source: Login
he: התחברות

source: Welcome to the exercise system!
he: ברוכים הבאים למערכת התרגילים!

source: Insert your username and password:
he: הזינו את שם המשתמש והסיסמה שלכם:

source: Username
he: שם משתמש

source: Forgot your password?
he: שכחת את הסיסמה?

source: Register
he: הירשם

source: Messages
he: הודעות

source: Mark all as read
he: סמן הכל כנקרא

source: Courses List
he: רשימת הקורסים

source: Upload Exercises
he: העלאת תרגילים

source: Exercises List
he: רשימת התרגילים

source: Exercises Archive
he: ארכיון התרגילים

source: Check Exercises
he: בדוק תרגילים

source: Logout
he: התנתקות

source: Public Courses List
he: רשימת קורסים פתוחים

source: Reset Password
he: אפס סיסמה

source: Insert password for changing it:
he: הזינו סיסמה לצורך שינוי הסיסמה:

source: Insert your email for getting link to reset it:
he: הזינו מייל לצורך שליחת קישור לאיפוס הסיסמה:

source: Email Address
he: כתובת אימייל

source: Send Reset Password Link
he: שלח מייל איפוס סיסמה

source: Back to login page
he: חזרה לדף ההתחברות

source: Registration
he: הרשמה

source: Insert your email and password for registration:
he: הזינו מייל וסיסמה לצורך רישום למערכת:

source: Full Name
he: שם מלא

source: Exercises operations room
he: חמ"ל תרגילים

source: Name
he: שם

source: Checked
he: נבדקו

source: Solved
he: נפתרו

source: Percentage
he: באחוזים

source: Measurement
he: מדד

source: Archive
he: ארכיון

source: Exercise name
he: שם תרגיל

source: By
he: על־ידי

source: Submitted
he: הוגש

source: Error? This is an old solution
he: שגיאה? זהו פתרון ישן

source: Go to detailed status view
he: לעמוד המצב המפורט

source: Upload Notebooks
he: העלאת מחברות

source: Drag here the notebook file or click and choose it from your computer.
he: גררו לכאן את קובץ המחברת, או לחצו ובחרו אותה מהמחשב שלכם.

source: Back to Exercises List
he: חזרו לרשימת התרגילים

source: Matches
he: הועלו

source: Misses
he: נכשלו

source: User details
he: פרטי משתמש

source: Actions
he: פעולות

source: Join Courses
he: הירשם לקורסים

source: Exercises Submitted
he: תרגילים שהוגשו

source: Course name
he: שם קורס

source: Submission status
he: מצב הגשה

source: Submission
he: הגשה

source: Checker
he: בודק

source: Assessment
he: הערכה מילולית

source: Not submitted
he: לא הוגש

source: Notes
he: פתקיות

source: New Note
he: פתקית חדשה

source: Related Exercise
he: עבור תרגיל

source: Privacy Level
he: רמת פרטיות

source: Add Note
he: הוסף פתקית

source: Exercise view
he: תצוגת תרגיל

source: Your solution had checked!
he: התרגיל שלך נבדק!

source: Click on the red lines in order to see the comments.
he: לחצו על השורות האדומות כדי לראות את הערות הבודקים.

source: Your solution is being checked in these moments!
he: התרגיל שלך נבדק ברגעים אלו!

source: This solution is not up to date!
he: פתרון זה אינו עדכני!

source: Your solution hasn't been checked.
he: הפתרון שלך עדיין לא נבדק.

source: It's important for us that all exercises will be checked by human eye.
he: חשוב לנו שכל תרגיל יעבור בדיקה של עין אנושית.

source: Solver
he: מגיש

source: Navigate in solution versions
he: ניווט בגרסאות ההגשה

source: Current page
he: סיסמה נוכחית

source: Finish Checking
he: סיום בדיקה

source: Automatic Checking
he: בדיקות אוטומטיות

source: Error
he: כישלון

source: Staff Error
he: כישלון סגל

source: Done Checking
he: סיים לבדוק

source: Confirmation mail - %(site_name)s
he: הודעת אימות - %(site_name)s

source: Hello %(fullname)s, Your confirmation link is: %(link)s
he: שלום %(fullname)s, קישור האימות שלך למערכת הוא: %(link)s

source: Reset password mail - %(site_name)s
he: הודעה על איפוס סיסמה - %(site_name)s

source: Hello %(fullname)s, Your reset password link is: %(link)s
he: שלום %(fullname)s, הקישור לצורך איפוס הסיסמה שלך הוא: %(link)s

source: Changing password - %(site_name)s
he: שינוי סיסמה - %(site_name)s

source: Hello %(fullname)s. Your password in %(site_name)s site has been changed. If you didn't do it please contact with the site management. Mail address: %(site_mail)s
he: שלום %(fullname)s. הסיסמה שלך באתר %(site_name)s שונתה. אם לא אתה שינית את הסיסמה, צור קשר עם הנהלת האתר. כתובת המייל שלך לפי רישומינו: %(site_mail)s
